app/Models/UsuarioModel.php

SELECT *
FROM `tipo_usuarios`
---
    public function obtenerRoles(){

        $roles = $this->db->table('tipo_usuarios');
        return $roles->get()->getResultArray();

INSERT INTO `usuarios` (`Nombre_Usuarios`, `ApellidoM_Usuarios`, `ApellidoP_Usuarios`, `Nick_Usuarios`, `Contraseña_Usuarios`, `DNI_Usuarios`, `Email_Usuarios`, `Telefono_Usuarios`, `Tipo_usuarios_ID_Tipo_Usuarios`) VALUES ('Aron', 'Copa', 'Choque', 'aron', 'aron123', '1564856', 'asdasdsa@gmail.com', '32545', '2')
---
    public function insertar($datos){
        $datos_del_usuario = $this->db->table('usuarios');
        $datos_del_usuario->insert($datos);